src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://touragency.com">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCountryRequest>
            <gs:id>1</gs:id>
        </gs:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>